test/data/invoice_test1.json

{
  "number": "20000077919999",
  "vendor": {
    "value": "A100-1043",
    "desc": "Konrad Theiss Verlag"
  },
  "vendor_account": "A100-1043",
  "currency": {
    "value": "CHF",
    "desc": "Swiss Franc"
  },
  "owner": {
    "value": "A100",
    "desc": "https://ub.unibas.ch/de/home/"
  },
  "payment": {
    "prepaid": false,
    "internal_copy": false,
    "payment_status": {
      "value": "NOT_PAID"
    },
    "voucher_date": "2020-12-07Z",
    "voucher_number": "",
    "voucher_amount": "53.49",
    "voucher_currency": {
      "value": "CHF",
      "desc": "Swiss Franc"
    }
  },
  "invoice_date": "2020-11-25Z",
  "total_amount": 54.10,
  "total_invoice_lines_amount": 54.10,
  "vendor_contact_person": {},
  "payment_method": {
    "value": "ACCOUNTINGDEPARTMENT",
    "desc": "Accounting Department"
  },
  "reference_number": "20096891",
  "creation_form": {
    "value": "MANUALLY",
    "desc": "Manually"
  },
  "invoice_status": {
    "value": "CLOSED",
    "desc": "Closed"
  },
  "invoice_workflow_status": {},
  "invoice_approval_status": {
    "value": "APPROVED",
    "desc": "Approved"
  },
  "approved_by": "Test User",
  "approval_date": "2020-12-07Z",
  "additional_charges": {
    "shipment": 0.0,
    "overhead": 0.0,
    "insurance": 0.0,
    "discount": 0.0,
    "use_pro_rata": true
  },
  "invoice_vat": {
    "percentage": 0.0,
    "type": {
      "value": "INCLUSIVE",
      "desc": "Inclusive"
    },
    "report_tax": false,
    "vat_per_invoice_line": false,
    "vat_code": {
      "value": ""
    },
    "vat_amount": 0,
    "expended_from_fund": true
  },
  "explicit_ratio": [],
  "alert": [
  ],
  "note": [],
  "number_of_lines": {
    "value": 1
  },
  "invoice_lines": {
    "invoice_line": [
      {
        "type": {
          "value": "REGULAR",
          "desc": "Regular"
        },
        "number": "1",
        "status": {
          "value": "READY",
          "desc": "Ready"
        },
        "price": 54.10,
        "quantity": 1,
        "note": "",
        "po_line": "POL-UBS-2024-131277",
        "price_note": "",
        "total_price": 54.10,
        "vat_note": "Approximately 0.00 included in line Total Price.",
        "check_subscription_date_overlap": true,
        "fully_invoiced": false,
        "additional_info": "",
        "release_remaining_encumbrance": false,
        "reporting_code": {
          "value": ""
        },
        "secondary_reporting_code": {
          "value": ""
        },
        "tertiary_reporting_code": {
          "value": ""
        },
        "invoice_line_vat": {
          "percentage": 0.0,
          "vat_code": {
            "value": ""
          },
          "vat_amount": 0
        },
        "fund_distribution": [
          {
            "percent": 100.0,
            "amount": 54.10,
            "fund_code": {
              "value": "Fundforall"
            }
          }
        ]
      }
    ],
    "total_record_count": 1
  }
}
